0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
4800
(
(0.0025 0.0025 0)
(0.0075 0.0025 6.02335e-21)
(0.0125 0.0025 0)
(0.0175 0.0025 -2.87774e-19)
(0.0225 0.0025 -2.87774e-19)
(0.0275 0.0025 0)
(0.0325 0.0025 0)
(0.0375 0.0025 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0 0.0025 0)
(0 0.0075 0)
(0 0.0125 0)
(0 0.0175 0)
(0 0.0225 0)
(0 0.0275 0)
(0 0.0325 0)
(0 0.0375 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0.5 0.0025 0)
(0.5 0.0075 0)
(0.5 0.0125 0)
(0.5 0.0175 0)
(0.5 0.0225 0)
(0.5 0.0275 0)
(0.5 0.0325 0)
(0.5 0.0375 0)
...
)
;
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    obstacle
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0.201189 0.000481768 0)
(0.203577 0.00142174 0)
(0.205982 0.0023144 0)
(0.208405 0.0031594 0)
(0.210844 0.00395641 0)
(0.213299 0.00470513 0)
(0.215767 0.00540525 0)
(0.218249 0.00605651 0)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
