0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
4800
(
0.0025
0.0075
0.0125
0.0175
0.0225
0.0275
0.0325
0.0375
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    obstacle
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.201189
0.203577
0.205982
0.208405
0.210844
0.213299
0.215767
0.218249
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
