0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
4800
(
0.0025
0.0025
0.0025
0.0025
0.0025
0.0025
0.0025
0.0025
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.0025
0.0075
0.0125
0.0175
0.0225
0.0275
0.0325
0.0375
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.0025
0.0075
0.0125
0.0175
0.0225
0.0275
0.0325
0.0375
...
)
;
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    obstacle
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.000481768
0.00142174
0.0023144
0.0031594
0.00395641
0.00470513
0.00540525
0.00605651
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
