system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0.005)
    (0.0 0.2 0.005)
    (0.2 0.0 0.005)
    (0.2 0.2 0.005)
    (0.3 0.0 0.005)
    (0.3 0.2 0.005)
    (0.5 0.0 0.005)
    (0.5 0.2 0.005)

    (0 0 -0.005)
    (0.0 0.2 -0.005)
    (0.2 0.0 -0.005)
    (0.2 0.2 -0.005)
    (0.3 0.0 -0.005)
    (0.3 0.2 -0.005)
    (0.5 0.0 -0.005)
    (0.5 0.2 -0.005)

);

edges
(
    arc 2 4 (0.25 0.01 0.005)
    arc 10 12 (0.25 0.01 -0.005)
);

blocks
(
    hex (8 10 11 9 0 2 3 1) (40 40 1) simpleGrading (1 1 1)
    hex (10 12 13 11 2 4 5 3) (40 40 1) simpleGrading (1 1 1)
    hex (12 14 15 13 4 6 7 5) (40 40 1) simpleGrading (1 1 1)

);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 9 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 7 15 14)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 2 10 8)
            (4 6 14 12)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (1 3 11 9)
            (3 5 13 11)
            (5 7 15 13)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (2 4 12 10)
        );
    }
);


// ************************************************************************* //
